markeet04/Wi-Health/firmware/dsp_selftest/sdkconfig.defaults
# ESP32-S3, console over the native USB-Serial-JTAG (VID 303A) at 921600 baud,
# mirroring the rx_csi_recv project so this flashes/monitors the same way.
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# The estimator uses double-precision FFT scratch; give the main task a
# generous stack so the on-device run doesn't overflow.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

CONFIG_LOG_DEFAULT_LEVEL_INFO=y
